# dropna Function

In [21]:
import pandas as pd

var2 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")
# This function is used to delete the blank data from table here we dont have a null data 
# Therefore we cannot delete anything also we can delete according to the axis

var2.dropna(axis = 1)

# PARAMTERS
# 1.IMPLACE

       Name  Age  Weight
0  Siddhant   20      55
1   Santosh   21      56
2        Om   21      54
3       Sai   23      67

# fillna Function

In [29]:
var2.fillna("xyz")   # This fucntion fill all the null data with xyz word here it doesnt because we dont have null data

var2.fillna({"Name":"xyz"})   # Here it replace the null value in column "Name" with the word xyz

var2.fillna(method = "ffill") # Fill the forward data into null
var2.fillna(method = "bfill") # Fill the backward data into null

var2.fillna("xyz",limit  = 1) # Here it will fill the first upcomming null value with xyz data into the  null

       Name  Age  Weight
0  Siddhant   20      55
1   Santosh   21      56
2        Om   21      54
3       Sai   23      67